Revit 2027 API
BuiltInFailures.DPartFailures.DeletingOriginalWillDeleteParts Property
 Deletion of this element will delete its associated Parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingOriginalWillDeleteParts { get; }
Public Shared ReadOnly Property DeletingOriginalWillDeleteParts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingOriginalWillDeleteParts {
	FailureDefinitionId^ get ();
}
static member DeletingOriginalWillDeleteParts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace